CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/xc.h
/*-------------------------------------------------------------------------
 * XC processor header
 * Build date : Feb 07 2020
 *
 * Copyright (c) 2019, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its
 * subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are 
 * met:
 * 
 * 1.      Redistributions of source code must retain the above copyright
 *         notice, this list of conditions and the following disclaimer.
 * 2.      Redistributions in binary form must reproduce the above 
 *         copyright notice, this list of conditions and the following 
 *         disclaimer in the documentation and/or other materials provided 
 *         with the distribution.
 * 3.      Microchip's name may not be used to endorse or promote products
 *         derived from this software without specific prior written 
 *         permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR PURPOSE ARE DISCLAIMED. IN NO EVENT 
 * SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR 
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
 * ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 */

#pragma once
#ifndef __XC_PIC32M_H
#define __XC_PIC32M_H

#ifndef __XC32_PART_SUPPORT_VERSION
#define __XC32_PART_SUPPORT_VERSION 2400
#endif
#ifndef __XC32_PART_SUPPORT_UPDATE
#define __XC32_PART_SUPPORT_UPDATE A
#endif

/* MECxxxx */
#if defined(__MEC1404__)
# include <proc/pmec1404.h>
#elif defined(__MEC1406__)
# include <proc/pmec1406.h>
#elif defined(__MEC1408__)
# include <proc/pmec1408.h>
#elif defined(__MEC1414__)
# include <proc/pmec1414.h>
#elif defined(__MEC1416__)
# include <proc/pmec1416.h>
#elif defined(__MEC1418__)
# include <proc/pmec1418.h>
#elif defined(__MEC1428__)
# include <proc/pmec1428.h>
#elif defined(__MGC3140__)
# include <proc/pmgc3140.h>
#elif defined(__MGC3430__)
# include <proc/pmgc3430.h>
#elif defined(__MGC3431__)
# include <proc/pmgc3431.h>
#elif defined(__MGC3450__)
# include <proc/pmgc3450.h>
#elif defined(__MGC3451__)
# include <proc/pmgc3451.h>
#elif defined(__MTCH6303__)
# include <proc/pmtch6303.h>

/* PIC32MK-GP */
#elif defined(__32MK0256GPG048__) || defined(__PIC32MK0256GPG048__)
# include <proc/p32mk0256gpg048.h>
#elif defined(__32MK0256GPG064__) || defined(__PIC32MK0256GPG064__)
# include <proc/p32mk0256gpg064.h>
#elif defined(__32MK0256GPH048__) || defined(__PIC32MK0256GPH048__)
# include <proc/p32mk0256gph048.h>
#elif defined(__32MK0256GPH064__) || defined(__PIC32MK0256GPH064__)
# include <proc/p32mk0256gph064.h>
#elif defined(__32MK0512GPD064__) || defined(__PIC32MK0512GPD064__)
# include <proc/p32mk0512gpd064.h>
#elif defined(__32MK0512GPD100__) || defined(__PIC32MK0512GPD100__)
# include <proc/p32mk0512gpd100.h>
#elif defined(__32MK0512GPE064__) || defined(__PIC32MK0512GPE064__)
# include <proc/p32mk0512gpe064.h>
#elif defined(__32MK0512GPE100__) || defined(__PIC32MK0512GPE100__)
# include <proc/p32mk0512gpe100.h>
#elif defined(__32MK0512GPG048__) || defined(__PIC32MK0512GPG048__)
# include <proc/p32mk0512gpg048.h>
#elif defined(__32MK0512GPG064__) || defined(__PIC32MK0512GPG064__)
# include <proc/p32mk0512gpg064.h>
#elif defined(__32MK0512GPH048__) || defined(__PIC32MK0512GPH048__)
# include <proc/p32mk0512gph048.h>
#elif defined(__32MK0512GPH064__) || defined(__PIC32MK0512GPH064__)
# include <proc/p32mk0512gph064.h>
#elif defined(__32MK0512GPK064__) || defined(__PIC32MK0512GPK064__)
# include <proc/p32mk0512gpk064.h>
#elif defined(__32MK0512GPK100__) || defined(__PIC32MK0512GPK100__)
# include <proc/p32mk0512gpk100.h>
#elif defined(__32MK0512GPL064__) || defined(__PIC32MK0512GPL064__)
# include <proc/p32mk0512gpl064.h>
#elif defined(__32MK0512GPL100__) || defined(__PIC32MK0512GPL100__)
# include <proc/p32mk0512gpl100.h>
#elif defined(__32MK1024GPD064__) || defined(__PIC32MK1024GPD064__)
# include <proc/p32mk1024gpd064.h>
#elif defined(__32MK1024GPD100__) || defined(__PIC32MK1024GPD100__)
# include <proc/p32mk1024gpd100.h>
#elif defined(__32MK1024GPE064__) || defined(__PIC32MK1024GPE064__)
# include <proc/p32mk1024gpe064.h>
#elif defined(__32MK1024GPE100__) || defined(__PIC32MK1024GPE100__)
# include <proc/p32mk1024gpe100.h>
#elif defined(__32MK1024GPK064__) || defined(__PIC32MK1024GPK064__)
# include <proc/p32mk1024gpk064.h>
#elif defined(__32MK1024GPK100__) || defined(__PIC32MK1024GPK100__)
# include <proc/p32mk1024gpk100.h>
#elif defined(__32MK1024GPL064__) || defined(__PIC32MK1024GPL064__)
# include <proc/p32mk1024gpl064.h>
#elif defined(__32MK1024GPL100__) || defined(__PIC32MK1024GPL100__)
# include <proc/p32mk1024gpl100.h>

/* PIC32MK-MC */
#elif defined(__32MK0256MCJ048__) || defined(__PIC32MK0256MCJ048__)
# include <proc/p32mk0256mcj048.h>
#elif defined(__32MK0256MCJ064__) || defined(__PIC32MK0256MCJ064__)
# include <proc/p32mk0256mcj064.h>
#elif defined(__32MK0512MCF064__) || defined(__PIC32MK0512MCF064__)
# include <proc/p32mk0512mcf064.h>
#elif defined(__32MK0512MCF100__) || defined(__PIC32MK0512MCF100__)
# include <proc/p32mk0512mcf100.h>
#elif defined(__32MK0512MCJ048__) || defined(__PIC32MK0512MCJ048__)
# include <proc/p32mk0512mcj048.h>
#elif defined(__32MK0512MCJ064__) || defined(__PIC32MK0512MCJ064__)
# include <proc/p32mk0512mcj064.h>
#elif defined(__32MK0512MCM064__) || defined(__PIC32MK0512MCM064__)
# include <proc/p32mk0512mcm064.h>
#elif defined(__32MK0512MCM100__) || defined(__PIC32MK0512MCM100__)
# include <proc/p32mk0512mcm100.h>
#elif defined(__32MK1024MCF064__) || defined(__PIC32MK1024MCF064__)
# include <proc/p32mk1024mcf064.h>
#elif defined(__32MK1024MCF100__) || defined(__PIC32MK1024MCF100__)
# include <proc/p32mk1024mcf100.h>
#elif defined(__32MK1024MCM064__) || defined(__PIC32MK1024MCM064__)
# include <proc/p32mk1024mcm064.h>
#elif defined(__32MK1024MCM100__) || defined(__PIC32MK1024MCM100__)
# include <proc/p32mk1024mcm100.h>

/* PIC32MM-GPL-0XX */
#elif defined(__32MM0016GPL020__) || defined(__PIC32MM0016GPL020__)
# include <proc/p32mm0016gpl020.h>
#elif defined(__32MM0016GPL028__) || defined(__PIC32MM0016GPL028__)
# include <proc/p32mm0016gpl028.h>
#elif defined(__32MM0016GPL036__) || defined(__PIC32MM0016GPL036__)
# include <proc/p32mm0016gpl036.h>
#elif defined(__32MM0032GPL020__) || defined(__PIC32MM0032GPL020__)
# include <proc/p32mm0032gpl020.h>
#elif defined(__32MM0032GPL028__) || defined(__PIC32MM0032GPL028__)
# include <proc/p32mm0032gpl028.h>
#elif defined(__32MM0032GPL036__) || defined(__PIC32MM0032GPL036__)
# include <proc/p32mm0032gpl036.h>
#elif defined(__32MM0064GPL020__) || defined(__PIC32MM0064GPL020__)
# include <proc/p32mm0064gpl020.h>
#elif defined(__32MM0064GPL028__) || defined(__PIC32MM0064GPL028__)
# include <proc/p32mm0064gpl028.h>
#elif defined(__32MM0064GPL036__) || defined(__PIC32MM0064GPL036__)
# include <proc/p32mm0064gpl036.h>

/* PIC32MM-GPM-0XX */
#elif defined(__32MM0064GPM028__) || defined(__PIC32MM0064GPM028__)
# include <proc/p32mm0064gpm028.h>
#elif defined(__32MM0064GPM036__) || defined(__PIC32MM0064GPM036__)
# include <proc/p32mm0064gpm036.h>
#elif defined(__32MM0064GPM048__) || defined(__PIC32MM0064GPM048__)
# include <proc/p32mm0064gpm048.h>
#elif defined(__32MM0064GPM064__) || defined(__PIC32MM0064GPM064__)
# include <proc/p32mm0064gpm064.h>
#elif defined(__32MM0128GPM028__) || defined(__PIC32MM0128GPM028__)
# include <proc/p32mm0128gpm028.h>
#elif defined(__32MM0128GPM036__) || defined(__PIC32MM0128GPM036__)
# include <proc/p32mm0128gpm036.h>
#elif defined(__32MM0128GPM048__) || defined(__PIC32MM0128GPM048__)
# include <proc/p32mm0128gpm048.h>
#elif defined(__32MM0128GPM064__) || defined(__PIC32MM0128GPM064__)
# include <proc/p32mm0128gpm064.h>
#elif defined(__32MM0256GPM028__) || defined(__PIC32MM0256GPM028__)
# include <proc/p32mm0256gpm028.h>
#elif defined(__32MM0256GPM036__) || defined(__PIC32MM0256GPM036__)
# include <proc/p32mm0256gpm036.h>
#elif defined(__32MM0256GPM048__) || defined(__PIC32MM0256GPM048__)
# include <proc/p32mm0256gpm048.h>
#elif defined(__32MM0256GPM064__) || defined(__PIC32MM0256GPM064__)
# include <proc/p32mm0256gpm064.h>

/* PIC32MX */
#elif defined(__32MX110F016B__) || defined(__PIC32MX110F016B__)
# include <proc/p32mx110f016b.h>
#elif defined(__32MX110F016C__) || defined(__PIC32MX110F016C__)
# include <proc/p32mx110f016c.h>
#elif defined(__32MX110F016D__) || defined(__PIC32MX110F016D__)
# include <proc/p32mx110f016d.h>
#elif defined(__32MX120F032B__) || defined(__PIC32MX120F032B__)
# include <proc/p32mx120f032b.h>
#elif defined(__32MX120F032C__) || defined(__PIC32MX120F032C__)
# include <proc/p32mx120f032c.h>
#elif defined(__32MX120F032D__) || defined(__PIC32MX120F032D__)
# include <proc/p32mx120f032d.h>
#elif defined(__32MX120F064H__) || defined(__PIC32MX120F064H__)
# include <proc/p32mx120f064h.h>
#elif defined(__32MX130F064B__) || defined(__PIC32MX130F064B__)
# include <proc/p32mx130f064b.h>
#elif defined(__32MX130F064C__) || defined(__PIC32MX130F064C__)
# include <proc/p32mx130f064c.h>
#elif defined(__32MX130F064D__) || defined(__PIC32MX130F064D__)
# include <proc/p32mx130f064d.h>
#elif defined(__32MX130F128H__) || defined(__PIC32MX130F128H__)
# include <proc/p32mx130f128h.h>
#elif defined(__32MX130F128L__) || defined(__PIC32MX130F128L__)
# include <proc/p32mx130f128l.h>
#elif defined(__32MX130F256B__) || defined(__PIC32MX130F256B__)
# include <proc/p32mx130f256b.h>
#elif defined(__32MX130F256D__) || defined(__PIC32MX130F256D__)
# include <proc/p32mx130f256d.h>
#elif defined(__32MX150F128B__) || defined(__PIC32MX150F128B__)
# include <proc/p32mx150f128b.h>
#elif defined(__32MX150F128C__) || defined(__PIC32MX150F128C__)
# include <proc/p32mx150f128c.h>
#elif defined(__32MX150F128D__) || defined(__PIC32MX150F128D__)
# include <proc/p32mx150f128d.h>
#elif defined(__32MX150F256H__) || defined(__PIC32MX150F256H__)
# include <proc/p32mx150f256h.h>
#elif defined(__32MX150F256L__) || defined(__PIC32MX150F256L__)
# include <proc/p32mx150f256l.h>
#elif defined(__32MX154F128B__) || defined(__PIC32MX154F128B__)
# include <proc/p32mx154f128b.h>
#elif defined(__32MX154F128D__) || defined(__PIC32MX154F128D__)
# include <proc/p32mx154f128d.h>
#elif defined(__32MX170F256B__) || defined(__PIC32MX170F256B__)
# include <proc/p32mx170f256b.h>
#elif defined(__32MX170F256D__) || defined(__PIC32MX170F256D__)
# include <proc/p32mx170f256d.h>
#elif defined(__32MX170F512H__) || defined(__PIC32MX170F512H__)
# include <proc/p32mx170f512h.h>
#elif defined(__32MX170F512L__) || defined(__PIC32MX170F512L__)
# include <proc/p32mx170f512l.h>
#elif defined(__32MX174F256B__) || defined(__PIC32MX174F256B__)
# include <proc/p32mx174f256b.h>
#elif defined(__32MX174F256D__) || defined(__PIC32MX174F256D__)
# include <proc/p32mx174f256d.h>
#elif defined(__32MX210F016B__) || defined(__PIC32MX210F016B__)
# include <proc/p32mx210f016b.h>
#elif defined(__32MX210F016C__) || defined(__PIC32MX210F016C__)
# include <proc/p32mx210f016c.h>
#elif defined(__32MX210F016D__) || defined(__PIC32MX210F016D__)
# include <proc/p32mx210f016d.h>
#elif defined(__32MX220F032B__) || defined(__PIC32MX220F032B__)
# include <proc/p32mx220f032b.h>
#elif defined(__32MX220F032C__) || defined(__PIC32MX220F032C__)
# include <proc/p32mx220f032c.h>
#elif defined(__32MX220F032D__) || defined(__PIC32MX220F032D__)
# include <proc/p32mx220f032d.h>
#elif defined(__32MX230F064B__) || defined(__PIC32MX230F064B__)
# include <proc/p32mx230f064b.h>
#elif defined(__32MX230F064C__) || defined(__PIC32MX230F064C__)
# include <proc/p32mx230f064c.h>
#elif defined(__32MX230F064D__) || defined(__PIC32MX230F064D__)
# include <proc/p32mx230f064d.h>
#elif defined(__32MX230F128H__) || defined(__PIC32MX230F128H__)
# include <proc/p32mx230f128h.h>
#elif defined(__32MX230F128L__) || defined(__PIC32MX230F128L__)
# include <proc/p32mx230f128l.h>
#elif defined(__32MX230F256B__) || defined(__PIC32MX230F256B__)
# include <proc/p32mx230f256b.h>
#elif defined(__32MX230F256D__) || defined(__PIC32MX230F256D__)
# include <proc/p32mx230f256d.h>
#elif defined(__32MX250F128B__) || defined(__PIC32MX250F128B__)
# include <proc/p32mx250f128b.h>
#elif defined(__32MX250F128C__) || defined(__PIC32MX250F128C__)
# include <proc/p32mx250f128c.h>
#elif defined(__32MX250F128D__) || defined(__PIC32MX250F128D__)
# include <proc/p32mx250f128d.h>
#elif defined(__32MX250F256H__) || defined(__PIC32MX250F256H__)
# include <proc/p32mx250f256h.h>
#elif defined(__32MX250F256L__) || defined(__PIC32MX250F256L__)
# include <proc/p32mx250f256l.h>
#elif defined(__32MX254F128B__) || defined(__PIC32MX254F128B__)
# include <proc/p32mx254f128b.h>
#elif defined(__32MX254F128D__) || defined(__PIC32MX254F128D__)
# include <proc/p32mx254f128d.h>
#elif defined(__32MX270F256B__) || defined(__PIC32MX270F256B__)
# include <proc/p32mx270f256b.h>
#elif defined(__32MX270F256D__) || defined(__PIC32MX270F256D__)
# include <proc/p32mx270f256d.h>
#elif defined(__32MX270F512H__) || defined(__PIC32MX270F512H__)
# include <proc/p32mx270f512h.h>
#elif defined(__32MX270F512L__) || defined(__PIC32MX270F512L__)
# include <proc/p32mx270f512l.h>
#elif defined(__32MX274F256B__) || defined(__PIC32MX274F256B__)
# include <proc/p32mx274f256b.h>
#elif defined(__32MX274F256D__) || defined(__PIC32MX274F256D__)
# include <proc/p32mx274f256d.h>
#elif defined(__32MX320F032H__) || defined(__PIC32MX320F032H__)
# include <proc/p32mx320f032h.h>
#elif defined(__32MX320F064H__) || defined(__PIC32MX320F064H__)
# include <proc/p32mx320f064h.h>
#elif defined(__32MX320F128H__) || defined(__PIC32MX320F128H__)
# include <proc/p32mx320f128h.h>
#elif defined(__32MX320F128L__) || defined(__PIC32MX320F128L__)
# include <proc/p32mx320f128l.h>
#elif defined(__32MX330F064H__) || defined(__PIC32MX330F064H__)
# include <proc/p32mx330f064h.h>
#elif defined(__32MX330F064L__) || defined(__PIC32MX330F064L__)
# include <proc/p32mx330f064l.h>
#elif defined(__32MX340F128H__) || defined(__PIC32MX340F128H__)
# include <proc/p32mx340f128h.h>
#elif defined(__32MX340F128L__) || defined(__PIC32MX340F128L__)
# include <proc/p32mx340f128l.h>
#elif defined(__32MX340F256H__) || defined(__PIC32MX340F256H__)
# include <proc/p32mx340f256h.h>
#elif defined(__32MX340F512H__) || defined(__PIC32MX340F512H__)
# include <proc/p32mx340f512h.h>
#elif defined(__32MX350F128H__) || defined(__PIC32MX350F128H__)
# include <proc/p32mx350f128h.h>
#elif defined(__32MX350F128L__) || defined(__PIC32MX350F128L__)
# include <proc/p32mx350f128l.h>
#elif defined(__32MX350F256H__) || defined(__PIC32MX350F256H__)
# include <proc/p32mx350f256h.h>
#elif defined(__32MX350F256L__) || defined(__PIC32MX350F256L__)
# include <proc/p32mx350f256l.h>
#elif defined(__32MX360F256L__) || defined(__PIC32MX360F256L__)
# include <proc/p32mx360f256l.h>
#elif defined(__32MX360F512L__) || defined(__PIC32MX360F512L__)
# include <proc/p32mx360f512l.h>
#elif defined(__32MX370F512H__) || defined(__PIC32MX370F512H__)
# include <proc/p32mx370f512h.h>
#elif defined(__32MX370F512L__) || defined(__PIC32MX370F512L__)
# include <proc/p32mx370f512l.h>
#elif defined(__32MX420F032H__) || defined(__PIC32MX420F032H__)
# include <proc/p32mx420f032h.h>
#elif defined(__32MX430F064H__) || defined(__PIC32MX430F064H__)
# include <proc/p32mx430f064h.h>
#elif defined(__32MX430F064L__) || defined(__PIC32MX430F064L__)
# include <proc/p32mx430f064l.h>
#elif defined(__32MX440F128H__) || defined(__PIC32MX440F128H__)
# include <proc/p32mx440f128h.h>
#elif defined(__32MX440F128L__) || defined(__PIC32MX440F128L__)
# include <proc/p32mx440f128l.h>
#elif defined(__32MX440F256H__) || defined(__PIC32MX440F256H__)
# include <proc/p32mx440f256h.h>
#elif defined(__32MX440F512H__) || defined(__PIC32MX440F512H__)
# include <proc/p32mx440f512h.h>
#elif defined(__32MX450F128H__) || defined(__PIC32MX450F128H__)
# include <proc/p32mx450f128h.h>
#elif defined(__32MX450F128L__) || defined(__PIC32MX450F128L__)
# include <proc/p32mx450f128l.h>
#elif defined(__32MX450F256H__) || defined(__PIC32MX450F256H__)
# include <proc/p32mx450f256h.h>
#elif defined(__32MX450F256L__) || defined(__PIC32MX450F256L__)
# include <proc/p32mx450f256l.h>
#elif defined(__32MX460F256L__) || defined(__PIC32MX460F256L__)
# include <proc/p32mx460f256l.h>
#elif defined(__32MX460F512L__) || defined(__PIC32MX460F512L__)
# include <proc/p32mx460f512l.h>
#elif defined(__32MX470F512H__) || defined(__PIC32MX470F512H__)
# include <proc/p32mx470f512h.h>
#elif defined(__32MX470F512L__) || defined(__PIC32MX470F512L__)
# include <proc/p32mx470f512l.h>
#elif defined(__32MX530F128H__) || defined(__PIC32MX530F128H__)
# include <proc/p32mx530f128h.h>
#elif defined(__32MX530F128L__) || defined(__PIC32MX530F128L__)
# include <proc/p32mx530f128l.h>
#elif defined(__32MX534F064H__) || defined(__PIC32MX534F064H__)
# include <proc/p32mx534f064h.h>
#elif defined(__32MX534F064L__) || defined(__PIC32MX534F064L__)
# include <proc/p32mx534f064l.h>
#elif defined(__32MX550F256H__) || defined(__PIC32MX550F256H__)
# include <proc/p32mx550f256h.h>
#elif defined(__32MX550F256L__) || defined(__PIC32MX550F256L__)
# include <proc/p32mx550f256l.h>
#elif defined(__32MX564F064H__) || defined(__PIC32MX564F064H__)
# include <proc/p32mx564f064h.h>
#elif defined(__32MX564F064L__) || defined(__PIC32MX564F064L__)
# include <proc/p32mx564f064l.h>
#elif defined(__32MX564F128H__) || defined(__PIC32MX564F128H__)
# include <proc/p32mx564f128h.h>
#elif defined(__32MX564F128L__) || defined(__PIC32MX564F128L__)
# include <proc/p32mx564f128l.h>
#elif defined(__32MX570F512H__) || defined(__PIC32MX570F512H__)
# include <proc/p32mx570f512h.h>
#elif defined(__32MX570F512L__) || defined(__PIC32MX570F512L__)
# include <proc/p32mx570f512l.h>
#elif defined(__32MX575F256H__) || defined(__PIC32MX575F256H__)
# include <proc/p32mx575f256h.h>
#elif defined(__32MX575F256L__) || defined(__PIC32MX575F256L__)
# include <proc/p32mx575f256l.h>
#elif defined(__32MX575F512H__) || defined(__PIC32MX575F512H__)
# include <proc/p32mx575f512h.h>
#elif defined(__32MX575F512L__) || defined(__PIC32MX575F512L__)
# include <proc/p32mx575f512l.h>
#elif defined(__32MX664F064H__) || defined(__PIC32MX664F064H__)
# include <proc/p32mx664f064h.h>
#elif defined(__32MX664F064L__) || defined(__PIC32MX664F064L__)
# include <proc/p32mx664f064l.h>
#elif defined(__32MX664F128H__) || defined(__PIC32MX664F128H__)
# include <proc/p32mx664f128h.h>
#elif defined(__32MX664F128L__) || defined(__PIC32MX664F128L__)
# include <proc/p32mx664f128l.h>
#elif defined(__32MX675F256H__) || defined(__PIC32MX675F256H__)
# include <proc/p32mx675f256h.h>
#elif defined(__32MX675F256L__) || defined(__PIC32MX675F256L__)
# include <proc/p32mx675f256l.h>
#elif defined(__32MX675F512H__) || defined(__PIC32MX675F512H__)
# include <proc/p32mx675f512h.h>
#elif defined(__32MX675F512L__) || defined(__PIC32MX675F512L__)
# include <proc/p32mx675f512l.h>
#elif defined(__32MX695F512H__) || defined(__PIC32MX695F512H__)
# include <proc/p32mx695f512h.h>
#elif defined(__32MX695F512L__) || defined(__PIC32MX695F512L__)
# include <proc/p32mx695f512l.h>
#elif defined(__32MX764F128H__) || defined(__PIC32MX764F128H__)
# include <proc/p32mx764f128h.h>
#elif defined(__32MX764F128L__) || defined(__PIC32MX764F128L__)
# include <proc/p32mx764f128l.h>
#elif defined(__32MX775F256H__) || defined(__PIC32MX775F256H__)
# include <proc/p32mx775f256h.h>
#elif defined(__32MX775F256L__) || defined(__PIC32MX775F256L__)
# include <proc/p32mx775f256l.h>
#elif defined(__32MX775F512H__) || defined(__PIC32MX775F512H__)
# include <proc/p32mx775f512h.h>
#elif defined(__32MX775F512L__) || defined(__PIC32MX775F512L__)
# include <proc/p32mx775f512l.h>
#elif defined(__32MX795F512H__) || defined(__PIC32MX795F512H__)
# include <proc/p32mx795f512h.h>
#elif defined(__32MX795F512L__) || defined(__PIC32MX795F512L__)
# include <proc/p32mx795f512l.h>

